load-test/benchmarks/results-before-2000vu.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: benchmarks/room-detail-bench.js
        output: -

     scenarios: (100.00%) 1 scenario, 2000 max VUs, 1m55s max duration (incl. graceful stop):
              * default: Up to 2000 looping VUs for 1m25s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2026-07-05T00:53:49+09:00" level=info msg="수집된 roomId 수: 50, 샘플: 13500,13499,13498,13497,13496" source=console

running (0m00.6s), 0034/2000 VUs, 19 complete and 0 interrupted iterations
default   [   0% ] 0034/2000 VUs  0m00.2s/1m25.0s

running (0m01.6s), 0167/2000 VUs, 825 complete and 0 interrupted iterations
default   [   1% ] 0167/2000 VUs  0m01.2s/1m25.0s

running (0m02.6s), 0300/2000 VUs, 2555 complete and 0 interrupted iterations
default   [   3% ] 0300/2000 VUs  0m02.2s/1m25.0s

running (0m03.6s), 0433/2000 VUs, 4251 complete and 0 interrupted iterations
default   [   4% ] 0433/2000 VUs  0m03.2s/1m25.0s

running (0m04.6s), 0566/2000 VUs, 5610 complete and 0 interrupted iterations
default   [   5% ] 0566/2000 VUs  0m04.2s/1m25.0s

running (0m05.6s), 0700/2000 VUs, 6306 complete and 0 interrupted iterations
default   [   6% ] 0700/2000 VUs  0m05.3s/1m25.0s

running (0m06.6s), 0833/2000 VUs, 6771 complete and 0 interrupted iterations
default   [   7% ] 0833/2000 VUs  0m06.2s/1m25.0s

running (0m07.6s), 0966/2000 VUs, 7927 complete and 0 interrupted iterations
default   [   9% ] 0966/2000 VUs  0m07.2s/1m25.0s

running (0m08.6s), 1099/2000 VUs, 9430 complete and 0 interrupted iterations
default   [  10% ] 1099/2000 VUs  0m08.2s/1m25.0s

running (0m09.6s), 1233/2000 VUs, 10456 complete and 0 interrupted iterations
default   [  11% ] 1233/2000 VUs  0m09.2s/1m25.0s

running (0m10.6s), 1366/2000 VUs, 11052 complete and 0 interrupted iterations
default   [  12% ] 1366/2000 VUs  0m10.2s/1m25.0s

running (0m11.6s), 1499/2000 VUs, 11979 complete and 0 interrupted iterations
default   [  13% ] 1499/2000 VUs  0m11.2s/1m25.0s

running (0m12.6s), 1633/2000 VUs, 13475 complete and 0 interrupted iterations
default   [  14% ] 1633/2000 VUs  0m12.2s/1m25.0s

running (0m13.6s), 1766/2000 VUs, 15176 complete and 0 interrupted iterations
default   [  16% ] 1766/2000 VUs  0m13.2s/1m25.0s

running (0m14.6s), 1899/2000 VUs, 16912 complete and 0 interrupted iterations
default   [  17% ] 1899/2000 VUs  0m14.2s/1m25.0s

running (0m15.6s), 2000/2000 VUs, 18705 complete and 0 interrupted iterations
default   [  18% ] 2000/2000 VUs  0m15.2s/1m25.0s

running (0m16.6s), 2000/2000 VUs, 20488 complete and 0 interrupted iterations
default   [  19% ] 2000/2000 VUs  0m16.2s/1m25.0s

running (0m17.6s), 2000/2000 VUs, 22173 complete and 0 interrupted iterations
default   [  20% ] 2000/2000 VUs  0m17.2s/1m25.0s

running (0m18.6s), 2000/2000 VUs, 23840 complete and 0 interrupted iterations
default   [  21% ] 2000/2000 VUs  0m18.2s/1m25.0s

running (0m19.6s), 2000/2000 VUs, 25599 complete and 0 interrupted iterations
default   [  23% ] 2000/2000 VUs  0m19.2s/1m25.0s

running (0m20.6s), 2000/2000 VUs, 27517 complete and 0 interrupted iterations
default   [  24% ] 2000/2000 VUs  0m20.2s/1m25.0s

running (0m21.6s), 2000/2000 VUs, 29387 complete and 0 interrupted iterations
default   [  25% ] 2000/2000 VUs  0m21.2s/1m25.0s

running (0m22.6s), 2000/2000 VUs, 31271 complete and 0 interrupted iterations
default   [  26% ] 2000/2000 VUs  0m22.2s/1m25.0s

running (0m23.6s), 2000/2000 VUs, 33247 complete and 0 interrupted iterations
default   [  27% ] 2000/2000 VUs  0m23.2s/1m25.0s

running (0m24.6s), 2000/2000 VUs, 35198 complete and 0 interrupted iterations
default   [  29% ] 2000/2000 VUs  0m24.2s/1m25.0s

running (0m25.6s), 2000/2000 VUs, 37147 complete and 0 interrupted iterations
default   [  30% ] 2000/2000 VUs  0m25.2s/1m25.0s

running (0m26.6s), 2000/2000 VUs, 39096 complete and 0 interrupted iterations
default   [  31% ] 2000/2000 VUs  0m26.2s/1m25.0s

running (0m27.6s), 2000/2000 VUs, 41011 complete and 0 interrupted iterations
default   [  32% ] 2000/2000 VUs  0m27.2s/1m25.0s

running (0m28.6s), 2000/2000 VUs, 42837 complete and 0 interrupted iterations
default   [  33% ] 2000/2000 VUs  0m28.2s/1m25.0s

running (0m29.6s), 2000/2000 VUs, 44224 complete and 0 interrupted iterations
default   [  34% ] 2000/2000 VUs  0m29.2s/1m25.0s

running (0m30.6s), 2000/2000 VUs, 45920 complete and 0 interrupted iterations
default   [  36% ] 2000/2000 VUs  0m30.2s/1m25.0s

running (0m31.6s), 2000/2000 VUs, 47648 complete and 0 interrupted iterations
default   [  37% ] 2000/2000 VUs  0m31.2s/1m25.0s

running (0m32.6s), 2000/2000 VUs, 49637 complete and 0 interrupted iterations
default   [  38% ] 2000/2000 VUs  0m32.2s/1m25.0s

running (0m33.6s), 2000/2000 VUs, 51588 complete and 0 interrupted iterations
default   [  39% ] 2000/2000 VUs  0m33.2s/1m25.0s

running (0m34.6s), 2000/2000 VUs, 53522 complete and 0 interrupted iterations
default   [  40% ] 2000/2000 VUs  0m34.2s/1m25.0s

running (0m35.6s), 2000/2000 VUs, 55463 complete and 0 interrupted iterations
default   [  41% ] 2000/2000 VUs  0m35.2s/1m25.0s

running (0m36.6s), 2000/2000 VUs, 57339 complete and 0 interrupted iterations
default   [  43% ] 2000/2000 VUs  0m36.2s/1m25.0s

running (0m37.6s), 2000/2000 VUs, 58911 complete and 0 interrupted iterations
default   [  44% ] 2000/2000 VUs  0m37.2s/1m25.0s

running (0m38.6s), 2000/2000 VUs, 59405 complete and 0 interrupted iterations
default   [  45% ] 2000/2000 VUs  0m38.2s/1m25.0s

running (0m39.6s), 2000/2000 VUs, 59986 complete and 0 interrupted iterations
default   [  46% ] 2000/2000 VUs  0m39.2s/1m25.0s

running (0m40.6s), 2000/2000 VUs, 60925 complete and 0 interrupted iterations
default   [  47% ] 2000/2000 VUs  0m40.2s/1m25.0s

running (0m41.6s), 2000/2000 VUs, 62344 complete and 0 interrupted iterations
default   [  49% ] 2000/2000 VUs  0m41.2s/1m25.0s

running (0m42.6s), 2000/2000 VUs, 64084 complete and 0 interrupted iterations
default   [  50% ] 2000/2000 VUs  0m42.2s/1m25.0s

running (0m43.6s), 2000/2000 VUs, 65937 complete and 0 interrupted iterations
default   [  51% ] 2000/2000 VUs  0m43.2s/1m25.0s

running (0m44.6s), 2000/2000 VUs, 67215 complete and 0 interrupted iterations
default   [  52% ] 2000/2000 VUs  0m44.2s/1m25.0s

running (0m45.6s), 2000/2000 VUs, 68496 complete and 0 interrupted iterations
default   [  53% ] 2000/2000 VUs  0m45.2s/1m25.0s

running (0m46.6s), 2000/2000 VUs, 70137 complete and 0 interrupted iterations
default   [  54% ] 2000/2000 VUs  0m46.2s/1m25.0s

running (0m47.6s), 2000/2000 VUs, 72122 complete and 0 interrupted iterations
default   [  56% ] 2000/2000 VUs  0m47.2s/1m25.0s

running (0m48.6s), 2000/2000 VUs, 74062 complete and 0 interrupted iterations
default   [  57% ] 2000/2000 VUs  0m48.2s/1m25.0s

running (0m49.6s), 2000/2000 VUs, 76058 complete and 0 interrupted iterations
default   [  58% ] 2000/2000 VUs  0m49.2s/1m25.0s

running (0m50.6s), 2000/2000 VUs, 77935 complete and 0 interrupted iterations
default   [  59% ] 2000/2000 VUs  0m50.2s/1m25.0s

running (0m51.6s), 2000/2000 VUs, 79667 complete and 0 interrupted iterations
default   [  60% ] 2000/2000 VUs  0m51.2s/1m25.0s

running (0m52.6s), 2000/2000 VUs, 81520 complete and 0 interrupted iterations
default   [  61% ] 2000/2000 VUs  0m52.2s/1m25.0s

running (0m53.6s), 2000/2000 VUs, 83295 complete and 0 interrupted iterations
default   [  63% ] 2000/2000 VUs  0m53.2s/1m25.0s

running (0m54.6s), 2000/2000 VUs, 85192 complete and 0 interrupted iterations
default   [  64% ] 2000/2000 VUs  0m54.2s/1m25.0s

running (0m55.6s), 2000/2000 VUs, 87127 complete and 0 interrupted iterations
default   [  65% ] 2000/2000 VUs  0m55.2s/1m25.0s

running (0m56.6s), 2000/2000 VUs, 89079 complete and 0 interrupted iterations
default   [  66% ] 2000/2000 VUs  0m56.2s/1m25.0s

running (0m57.6s), 2000/2000 VUs, 90799 complete and 0 interrupted iterations
default   [  67% ] 2000/2000 VUs  0m57.2s/1m25.0s

running (0m58.6s), 2000/2000 VUs, 92748 complete and 0 interrupted iterations
default   [  69% ] 2000/2000 VUs  0m58.2s/1m25.0s

running (0m59.6s), 2000/2000 VUs, 94721 complete and 0 interrupted iterations
default   [  70% ] 2000/2000 VUs  0m59.2s/1m25.0s

running (1m00.6s), 2000/2000 VUs, 96698 complete and 0 interrupted iterations
default   [  71% ] 2000/2000 VUs  1m00.2s/1m25.0s

running (1m01.6s), 2000/2000 VUs, 98570 complete and 0 interrupted iterations
default   [  72% ] 2000/2000 VUs  1m01.2s/1m25.0s

running (1m02.6s), 2000/2000 VUs, 100518 complete and 0 interrupted iterations
default   [  73% ] 2000/2000 VUs  1m02.2s/1m25.0s

running (1m03.6s), 2000/2000 VUs, 102386 complete and 0 interrupted iterations
default   [  74% ] 2000/2000 VUs  1m03.2s/1m25.0s

running (1m04.6s), 2000/2000 VUs, 104351 complete and 0 interrupted iterations
default   [  76% ] 2000/2000 VUs  1m04.2s/1m25.0s

running (1m05.6s), 2000/2000 VUs, 106343 complete and 0 interrupted iterations
default   [  77% ] 2000/2000 VUs  1m05.2s/1m25.0s

running (1m06.6s), 2000/2000 VUs, 108353 complete and 0 interrupted iterations
default   [  78% ] 2000/2000 VUs  1m06.2s/1m25.0s

running (1m07.6s), 2000/2000 VUs, 110276 complete and 0 interrupted iterations
default   [  79% ] 2000/2000 VUs  1m07.2s/1m25.0s

running (1m08.6s), 2000/2000 VUs, 112052 complete and 0 interrupted iterations
default   [  80% ] 2000/2000 VUs  1m08.2s/1m25.0s

running (1m09.6s), 2000/2000 VUs, 113843 complete and 0 interrupted iterations
default   [  81% ] 2000/2000 VUs  1m09.2s/1m25.0s

running (1m10.6s), 2000/2000 VUs, 115831 complete and 0 interrupted iterations
default   [  83% ] 2000/2000 VUs  1m10.2s/1m25.0s

running (1m11.6s), 2000/2000 VUs, 117536 complete and 0 interrupted iterations
default   [  84% ] 2000/2000 VUs  1m11.2s/1m25.0s

running (1m12.6s), 2000/2000 VUs, 119309 complete and 0 interrupted iterations
default   [  85% ] 2000/2000 VUs  1m12.2s/1m25.0s

running (1m13.6s), 2000/2000 VUs, 120353 complete and 0 interrupted iterations
default   [  86% ] 2000/2000 VUs  1m13.2s/1m25.0s

running (1m14.6s), 2000/2000 VUs, 121465 complete and 0 interrupted iterations
default   [  87% ] 2000/2000 VUs  1m14.2s/1m25.0s

running (1m15.6s), 1998/2000 VUs, 123305 complete and 0 interrupted iterations
default   [  89% ] 1998/2000 VUs  1m15.2s/1m25.0s

running (1m16.6s), 1843/2000 VUs, 125262 complete and 0 interrupted iterations
default   [  90% ] 1843/2000 VUs  1m16.2s/1m25.0s

running (1m17.6s), 1646/2000 VUs, 127237 complete and 0 interrupted iterations
default   [  91% ] 1646/2000 VUs  1m17.2s/1m25.0s

running (1m18.6s), 1425/2000 VUs, 129252 complete and 0 interrupted iterations
default   [  92% ] 1425/2000 VUs  1m18.2s/1m25.0s

running (1m19.6s), 1217/2000 VUs, 131261 complete and 0 interrupted iterations
default   [  93% ] 1217/2000 VUs  1m19.2s/1m25.0s

running (1m20.6s), 1004/2000 VUs, 133237 complete and 0 interrupted iterations
default   [  94% ] 1004/2000 VUs  1m20.2s/1m25.0s

running (1m21.6s), 0787/2000 VUs, 135269 complete and 0 interrupted iterations
default   [  96% ] 0787/2000 VUs  1m21.2s/1m25.0s

running (1m22.6s), 0581/2000 VUs, 137263 complete and 0 interrupted iterations
default   [  97% ] 0581/2000 VUs  1m22.2s/1m25.0s

running (1m23.6s), 0370/2000 VUs, 139204 complete and 0 interrupted iterations
default   [  98% ] 0370/2000 VUs  1m23.2s/1m25.0s

running (1m24.6s), 0162/2000 VUs, 141027 complete and 0 interrupted iterations
default   [  99% ] 0162/2000 VUs  1m24.2s/1m25.0s


  █ THRESHOLDS 

    room_detail_duration
    ✓ 'p(95)<5000' p(95)=1.5s

    room_detail_errors
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 141732  1658.101994/s
    checks_succeeded...: 100.00% 141732 out of 141732
    checks_failed......: 0.00%   0 out of 141732

    ✓ status 200

    CUSTOM
    room_detail_duration...........: avg=926.64ms min=2ms      med=945ms    max=3.22s p(90)=1.18s p(95)=1.5s
    room_detail_errors.............: 0.00%  0 out of 141732

    HTTP
    http_req_duration..............: avg=926.53ms min=2.16ms   med=944.85ms max=3.22s p(90)=1.18s p(95)=1.5s
      { expected_response:true }...: avg=926.53ms min=2.16ms   med=944.85ms max=3.22s p(90)=1.18s p(95)=1.5s
    http_req_failed................: 0.00%  0 out of 141734
    http_reqs......................: 141734 1658.125392/s

    EXECUTION
    iteration_duration.............: avg=1.02s    min=102.26ms med=1.04s    max=3.33s p(90)=1.28s p(95)=1.6s
    iterations.....................: 141732 1658.101994/s
    vus............................: 162    min=33          max=2000
    vus_max........................: 2000   min=2000        max=2000

    NETWORK
    data_received..................: 192 MB 2.2 MB/s
    data_sent......................: 44 MB  509 kB/s



running (1m25.5s), 0000/2000 VUs, 141732 complete and 0 interrupted iterations
default ✓ [ 100% ] 0000/2000 VUs  1m25s